martijnschouten/OCHVPS_FW/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t PS_HV_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA13 (pin 65)  */
    GPIO_PinInit(PS_HV_EN_GPIO, PS_HV_EN_PIN, &PS_HV_EN_config);

    gpio_pin_config_t PS_SW_STATE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 114)  */
    GPIO_PinInit(PS_SW_STATE_GPIO, PS_SW_STATE_PIN, &PS_SW_STATE_config);

    gpio_pin_config_t PS_12V_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 117)  */
    GPIO_PinInit(PS_12V_EN_GPIO, PS_12V_EN_PIN, &PS_12V_EN_config);

    gpio_pin_config_t HB_LG1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin 127)  */
    GPIO_PinInit(HB_LG1_GPIO, HB_LG1_PIN, &HB_LG1_config);

    gpio_pin_config_t HB_HG1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 128)  */
    GPIO_PinInit(HB_HG1_GPIO, HB_HG1_PIN, &HB_HG1_config);

    gpio_pin_config_t HB_LG2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 129)  */
    GPIO_PinInit(HB_LG2_GPIO, HB_LG2_PIN, &HB_LG2_config);

    gpio_pin_config_t HB_HG2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 130)  */
    GPIO_PinInit(HB_HG2_GPIO, HB_HG2_PIN, &HB_HG2_config);

    gpio_pin_config_t HB_LG3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 131)  */
    GPIO_PinInit(HB_LG3_GPIO, HB_LG3_PIN, &HB_LG3_config);

    gpio_pin_config_t HB_HG3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD5 (pin 132)  */
    GPIO_PinInit(HB_HG3_GPIO, HB_HG3_PIN, &HB_HG3_config);

    gpio_pin_config_t HB_LG4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD6 (pin 133)  */
    GPIO_PinInit(HB_LG4_GPIO, HB_LG4_PIN, &HB_LG4_config);

    gpio_pin_config_t HB_HG4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD7 (pin 136)  */
    GPIO_PinInit(HB_HG4_GPIO, HB_HG4_PIN, &HB_HG4_config);

    gpio_pin_config_t HB_LG5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD8 (pin 137)  */
    GPIO_PinInit(HB_LG5_GPIO, HB_LG5_PIN, &HB_LG5_config);

    gpio_pin_config_t HB_HG5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD9 (pin 138)  */
    GPIO_PinInit(HB_HG5_GPIO, HB_HG5_PIN, &HB_HG5_config);

    gpio_pin_config_t HB_LG6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD10 (pin 139)  */
    GPIO_PinInit(HB_LG6_GPIO, HB_LG6_PIN, &HB_LG6_config);

    gpio_pin_config_t HB_HG6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD11 (pin 140)  */
    GPIO_PinInit(HB_HG6_GPIO, HB_HG6_PIN, &HB_HG6_config);

    gpio_pin_config_t HB_LG7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin 141)  */
    GPIO_PinInit(HB_LG7_GPIO, HB_LG7_PIN, &HB_LG7_config);

    gpio_pin_config_t HB_HG7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin 142)  */
    GPIO_PinInit(HB_HG7_GPIO, HB_HG7_PIN, &HB_HG7_config);

    gpio_pin_config_t HB_LG8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 143)  */
    GPIO_PinInit(HB_LG8_GPIO, HB_LG8_PIN, &HB_LG8_config);

    gpio_pin_config_t HB_HG8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 144)  */
    GPIO_PinInit(HB_HG8_GPIO, HB_HG8_PIN, &HB_HG8_config);

    /* PORTA0 (pin 50) is configured as JTAG_TCLK */
    PORT_SetPinMux(JTAG_TCLK_PORT, JTAG_TCLK_PIN, kPORT_MuxAlt7);

    /* PORTA1 (pin 51) is configured as JTAG_TDI */
    PORT_SetPinMux(JTAG_TDI_PORT, JTAG_TDI_PIN, kPORT_MuxAlt7);

    /* PORTA13 (pin 65) is configured as PTA13 */
    PORT_SetPinMux(PS_HV_EN_PORT, PS_HV_EN_PIN, kPORT_MuxAsGpio);

    /* PORTA14 (pin 66) is configured as UART0_TX */
    PORT_SetPinMux(USB_UART_TX_PORT, USB_UART_TX_PIN, kPORT_MuxAlt3);

    /* PORTA15 (pin 67) is configured as UART0_RX */
    PORT_SetPinMux(USB_UART_RX_PORT, USB_UART_RX_PIN, kPORT_MuxAlt3);

